//1
// let a = +prompt("Введите число");
// if (a === 0) {
//     alert("это ноль")
// };
// if (a < 0) {
//     alert("это отрицательное число")
// };
// if (a > 0) {
//     alert("это положительное число")
// };


//2
// let a = +prompt("Введите Ваш возраст");
// if (a <= 0 ) {
//     alert("Вы еще не родились")
// } else if (a >= 120) {
//     alert("столько не живут")
// } else {
//     alert(`Вам ${a} лет`)
// };


//3
// let f = +prompt("Введите число");
// if (f < 0) {
//     f = f * -1
// }
// alert(`модуль числа = ${f}`);

//4
// let x = +prompt("Введите координату х");
// let y = +prompt("Введите координату y");
// console.log(x);
// console.log(y);
// if (y === 0 && x === 0) {
//     prompt("начало координат")
// } else if (x > 0 && y > 0) {
//     prompt("1-я четверть")
// } else if (x < 0 && y > 0) {
//     prompt("2-я четверть")
// } else if (x < 0 && y < 0) {
//     prompt("3-я четверть")
// } else if (x > 0 && y < 0) {
//     prompt("4-я четверть")
// } else if (x > 0 && y < 0) {
//     prompt("4-я четверть")
// } else if (x === 0 ) {
//     prompt("ось х")
// } else if (y === 0 ) {
//     prompt("ось y")
// };


//5
// let a = +prompt("Введите год рождения")
// let b = a % 12;
// console.log(b)
// if (b === 0) {
//     alert("Вы обезьяна по китайскому календарю")
// } else if (b === 1) {
//     alert("Вы петух по китайскому календарю")
// } else if (b === 2) {
//     alert("Вы собака по китайскому календарю")
// } else if (b === 3) {
//     alert("Вы свинья по китайскому календарю")
// } else if (b === 4) {
//     alert("Вы крыса по китайскому календарю")
// } else if (b === 5) {
//     alert("Вы бык по китайскому календарю")
// } else if (b === 6) {
//     alert("Вы тигр по китайскому календарю")
// } else if (b === 7) {
//     alert("Вы кролик по китайскому календарю")
// } else if (b === 8) {
//     alert("Вы дракон по китайскому календарю")
// } else if (b === 9) {
//     alert("Вы змея по китайскому календарю")
// } else if (b === 10) {
//     alert("Вы лошадь по китайскому календарю")
// } else if (b === 11) {
//     alert("Вы коза по китайскому календарю")
// };